// Цикл на кожній ітерації пропонує через prompt ввести число більше 100 (але максимум 10 ітерацій циклу) . 
// Якщо відвідувач ввів число менше ста – попросити ввести ще раз, і таке інше. Якщо користувач вводить більше ста, 
// текст або цикл закінчує всі ітерації, то функція виводить в консоль останній введення користувача і завершує функцію.


function numberCount() {
    let number;
    for (let i = 0; i < 10; i++) {
        number = prompt("Enter a number higher than 100");

        // введене число буде строкою, тому переводимо його в число
        number = Number(number);

        // перевірка чи введене користувачем є числом 
        if (isNaN(number)) {
            console.log("Please enter a valid number.");
            continue; // Продовжуємо цикл, якщо введено не число
        }

        // якщо користувач ввів правильне число, то виводимо його і завершуємо цикл
        if (number > 100) {
            console.log(`You entered: ${number}`);
            return number;
        }
    }
    // якщо користувач після 10 ітерацій циклу не ввів валідне число, то виводимо останнє, що він ввів
    console.log(`You entered: ${number}`);
    return number;
}

numberCount();