//Дано ціле число N (ввести через prompt). Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N


let wholeNumb = prompt ( `Введіть ціле число `);

// через метод "prompt" ми отримуємо строку. Через функцію "Number" строку переводимо у число, щоб у наступних кроках ним могти оперувати

let number = Number(wholeNumb);

const maxNumber = 100; 

// створюємо цикл для чисел від 1 до 100 із введеною змінною піднесення числа у циклі до квадрату

for (let n=1; n <= maxNumber; n++) {
    const square = n ** 2;

// цикл буде тривати доти, доки квадрат числа із нього буде меншим або дорівнюватиме введеному числу 

    if (square <= number) {
        console.log(`Ось всі цілі числа квадрат яких не перевищує ваше введене число: ${square}`);
    } else {
       break;
    }
}